import 'package:get/get.dart';
import '../../../../global/constants/images.dart';
import '../view/notice_details_screen.dart';

// Notice Model
class NoticeModel {
  final String date;
  final String title;
  final String details;
  final String imagePath;
  final Function() onTap;

  NoticeModel({
    required this.date,
    required this.title,
    required this.details,
    required this.imagePath,
    required this.onTap,
  });
}

// Define the list of Notice Others
final List<NoticeModel> noticeModel = [
  NoticeModel(
    date: "10/05/2024",
    title: "উদ্ভাবনী প্রদর্শনীতে অংশগ্রহনের নোটিশ, সকল শিক্ষার্থীদের জন্য।",
    details: """আবেদনের যোগ্যতা ও অভিজ্ঞতা
(১) সংশ্লিষ্ট বিভাগে ০৪ (চার) বছর মেয়াদি স্নাতক এবং স্নাতকোত্তর ডিগ্রি থাকতে হবে। (২) স্নাতক পরীক্ষায় সিজিপিএ ৪.০০-এর মধ্যে সিজিপিএ ন্যূনতম ৩.৫০ থাকতে হবে। (৩) শিক্ষাজীবনের সকল পর্যায়ে প্রথম বিভাগ/ শ্রেণি/ সমমানের সিজিপিএ থাকতে হবে।
সাধারণ শর্তাবলি:
১। আগ্রহী প্রার্থীগণকে ৮ (আট) সেট পরিপূর্ণ আবেদনপত্র আগামী ২৯/০২/২০২৪ খ্রি. তারিখের মধ্যে অফিস চলাকালীন সময়ে (সরকারী ছুটির দিন ব্যতীত সকাল ৯.০০ টা থেকে বিকাল ৪.০০ টা) বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়, মেলান্দহ, জামালপুর-২০১২ এর ঠিকানায় রেজিস্টার্ড ডাকযোগে প্রেরণ করতে হবে। খামের উপর প্রার্থীত পদের নাম অবশ্যই উল্লেখ করতে হবে।
২। প্রার্থীদেরকে আবেদনপত্রের সাথে “রেজিস্ট্রার, বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়”-এর অনুকূলে জনতা ব্যাংকের যে কোনো শাখা হতে ৮০০/- (আটশত) মূল্যের MICR পে-অর্ডার/ব্যাংক ড্রাফট (অফেরতযোগ্য) সংযুক্ত করতে হবে।
৩। আবেদনপত্র ও জীবনবৃত্তান্ত ছকের সঙ্গে নিম্নবর্ণিত কাগজপত্র সংযোজন করতে হবে:
(ক) সদ্য তোলা পাসপোর্ট সাইজের ৪ (চার) কপি সত্যায়িত ছবি ।
(খ) সকল পরীক্ষা পাসের সার্টিফিকেট ও ট্রান্সক্রিপ্ট-এর সত্যায়িত অনুলিপি ৷
(গ) অভিজ্ঞতার সনদ-এর সত্যায়িত অনুলিপি। (প্রযোজ্য ক্ষেত্রে)।
(ঘ) প্রকাশনা/প্রশিক্ষণ ইত্যাদি (প্রযোজ্য ক্ষেত্রে) এর সত্যায়িত অনুলিপি ।
(ঙ) জাতীয় পরিচয়পত্র/ জন্ম নিবন্ধনের সত্যায়িত অনুলিপি ।
(চ) ১০ (দশ) টাকা মূল্যের ডাক টিকিটসহ নিজ ঠিকানা উল্লেখপূর্বক ৯ ×৪” সাইজের ফেরত খাম (১টি)।
৪। চাকরিরত প্রার্থীদেরকে তাঁদের স্ব-স্ব নিয়োগকারী কর্তৃপক্ষের মাধ্যমে আবেদন করতে হবে। অগ্রিম আবেদনপত্র গ্রহণযোগ্য হবে না ।
৫। চাকরিরত কোনো প্রার্থীর ক্ষেত্রে বিভাগীয় মামলা থাকলে অথবা কোনো প্রার্থী ইতঃপূর্বে কোনো প্রতিষ্ঠান হতে চাকরিচ্যুত বা অপসারিত হয়ে থাকলে
অথবা কোনো প্রার্থী ফৌজদারী আইনে অভিযুক্ত বা সাজাপ্রাপ্ত হয়ে থাকলে তিনি আবেদন করার যোগ্য হবেন না ।
৬। অসম্পূর্ণ এবং স্বাক্ষরবিহীন আবেদনপত্র সরাসরি বাতিল বলে গণ্য হবে। স্ক্যানকৃত স্বাক্ষর গ্রহণযোগ্য নয় ।
৭। অভ্যন্তরীণ প্রার্থীদের ক্ষেত্রে বয়স ও শিক্ষাগত যোগ্যতার ক্ষেত্রে বিশ্ববিদ্যালয়ের ‘নিয়োগ ও পদোন্নয়ন নীতিমালা ২০২২' অনুসরণ করা হবে।
৮। শিক্ষাগত যোগ্যতার ক্ষেত্রে পরীক্ষার কোনো ধাপসহ অন্য কোনো তথ্য গোপন করা হলে সেক্ষেত্রে নিয়োগ বাতিলসহ উহা শাস্তিযোগ্য অপরাধ বলে গণ্য হবে।
৯। অতিরিক্ত যোগ্যতা, অভিজ্ঞতাসহ অন্যান্য তথ্যের জন্য পৃথক কাগজ ব্যবহার করা যাবে।
""",
    imagePath: Images.directoryIc,
    onTap: () {
      Get.to(() => const NoticeDetailsScreen(date: '', title: '', details: '',));
    },
  ),
  NoticeModel(
    date: "19/05/2024",
    title: "সেবা প্রদান বিষয়ে অংশীজন সভা অনুষ্ঠিত",
    details: """বশেফমুবিপ্রবিতে সেবা প্রদান বিষয়ে অংশীজন সভা অনুষ্ঠিত বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে (বশেফমুবিপ্রবি) মঙ্গলবার দুপুরে অংশীজন সভা অনুষ্ঠিত হয়েছে। বার্ষিক কর্মসম্পাদন চুক্তির (এপিএ) আওতায় সেবা প্রদান প্রতিশ্রুতি বিষয়ক কর্মপরিকল্পনা বাস্তবায়নের অংশ হিসেবে উপাচার্যের সভাকক্ষে এ সভা হয়। এতে প্রধান অতিথি ছিলেন বিশ্ববিদ্যালয়ের মাননীয় উপাচার্য অধ্যাপক ড. মো. কামরুল আলম খান। সেবাপ্রদান প্রতিশ্রুতি বিষয়ক কমিটির আহ্বায়ক মো. মোখলেসুর রহমানের সভাপতিত্বে অনুষ্ঠানে ট্রেজারার মোহাম্মদ আবদুল মাননান, রেজিস্ট্রার সৈয়দ ফারুক হোসেন ও প্রক্টর (ভারপ্রাপ্ত) এস.এম. ইউসুফ আলী বিশেষ অতিথি হিসেবে উপস্থিত ছিলেন। 
""",
    imagePath: Images.calendarIc,
    onTap: () {
      Get.to(() => const NoticeDetailsScreen(date: '', title: '', details: '',));
    },
  ),
  NoticeModel(
    date: "10/08/2024",
    title: "তথ্য অধিকার বিষয়ে সেমিনার অনুষ্ঠিত",
    details: """বশেফমুবিপ্রবিতে তথ্য অধিকার বিষয়ে সেমিনার অনুষ্ঠিত বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে (বশেফমুবিপ্রবি) মঙ্গলবার (১৯ মার্চ) তথ্য অধিকার আইন-২০০৯ এবং সংশ্লিষ্ট বিধিমালা ও প্রবিধিমালা বিষয়ে জনসচেতনতা সৃষ্টির লক্ষ্যে সেমিনার অনুষ্ঠিত হয়েছে। বিশ্বদ্যিালয়ের প্রশাসনিক ভবনে উপাচার্যের সভাকক্ষে আয়োজিত এ সেমিনারে বিভিন্ন বিভাগ ও দপ্তর/শাখার প্রধানগণ অংশগ্রহণ করেন। এতে মাননীয় উপাচার্য অধ্যাপক ড. মো. কামরুল আলম খান প্রধান অতিথি হিসেবে উপস্থিত ছিলেন। তিনি তথ্য অধিকার আইনের বিভিন্ন বিষয়ে বিস্তারিত আলোচনা করেন। 
""",
    imagePath: Images.calendarIc,
    onTap: () {
      Get.to(() => const NoticeDetailsScreen(date: '', title: '', details: '',));
    },
  ),
  NoticeModel(
    date: "10/05/2024",
    title: "বশেফমুবিপ্রবি শিক্ষক ড. মাহমুদুল হাছানের গবেষণায় রুই মাছের জীবন রহস্য উন্মোচন",
    details: """প্রেস বিজ্ঞপ্তি বশেফমুবিপ্রবি শিক্ষক ড. মাহমুদুল হাছানের গবেষণায় রুই মাছের জীবন রহস্য উন্মোচন বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ের (বশেফমুবিপ্রবি) ফিশারিজ বিভাগের সহকারী অধ্যাপক ও গবেষণা সেলের পরিচালক (ভারপ্রাপ্ত) ড. মাহমুদুল হাছানের নেতৃত্বে গবেষণায় যমুনা নদীর রুই মাছের জীবন রহস্য উন্মোচিত হয়েছে। বুধবার (২৮ ফেব্রুয়ারি) বিশ্ববিদ্যালয়ের উপাচার্য দপ্তরের সভাকক্ষে আয়োজিত এক সেমিনারে এ তথ্য জানানো হয়। এতে প্রধান অতিথি হিসেবে বিশ্ববিদ্যালয়ের মাননীয় উপাচার্য অধ্যাপক ড. মো. কামরুল আলম খান উপস্থিত ছিলেন।
""",
    imagePath: Images.directoryIc,
    onTap: () {
      Get.to(() => const NoticeDetailsScreen(date: '', title: '', details: '',));
    },
  ),
  NoticeModel(
    date: "19/05/2024",
    title: "বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে ই-জিপি চালু",
    details: """বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে ই-জিপি চালু বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে (বশেফমুবিপ্রবি) সবধরনের কেনাকাটা ও কাজ সম্পাদনে ইলেকট্রনিক গভর্নমেন্ট প্রকিউরমেন্ট (ই-জিপি) চালু করা হয়েছে। বুধবার (২৮ ফেব্রুয়ারি) বিকেলে মাননীয় উপাচার্য অধ্যাপক ড. মো. কামরুল আলম খান ওয়েবসাইটে ‘Construction of Parapet Wall, Repair of HBB Road & Earth Filling Works of inside boundary wall of Nurunnahar Begum Hall at BSFMSTUÕ শীর্ষক কাজের অনুমোদন দেয়ার মাধ্যমে ই-জিপিতে বিশ্ববিদ্যালয়ের আনুষ্ঠানিক যাত্রা শুরু হয়। এ সময় মাননীয় উপাচার্য বলেন, সরকারি ক্রয়-প্রক্রিয়া সহজতর করতে ই-জিপি চালু হয়েছে। এর ফলে দেশের যেকোনো জায়গা থেকে সহজেই দরপত্র জমা দেয়ার সুযোগ থাকবে। 
""",
    imagePath: Images.calendarIc,
    onTap: () {
      Get.to(() => const NoticeDetailsScreen(date: '', title: '', details: '',));
    },
  ),
  NoticeModel(
    date: "10/08/2024",
    title: "বশেফমুবিপ্রবিতে স্মার্ট বাংলাদেশ বিনির্মাণ বিষয়ক কর্মশালা অনুষ্ঠিত",
    details: """বশেফমুবিপ্রবিতে স্মার্ট বাংলাদেশ বিনির্মাণ বিষয়ক কর্মশালা অনুষ্ঠিত বঙ্গমাতা শেখ ফজিলাতুন্নেছা মুজিব বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে সোমবার (১৮ সেপ্টেম্বর) ই-গভর্ন্যান্স ও উদ্ভাবন কর্মপরিকল্পনার অন্তর্ভুক্ত স্মার্ট বাংলাদেশ বিনির্মাণ বিষয়ক কর্মশালা অনুষ্ঠিত হয়েছে। এতে মাননীয় উপাচার্য অধ্যাপক ড. মো. কামরুল আলম খান প্রধান অতিথি হিসেবে উপস্থিত ছিলেন। তিনি স্মার্ট বাংলাদেশ শীর্ষক একটি প্রেজেন্টেশন প্রদান করেন। একই সঙ্গে গবেষকদের উদ্ভাবনী কার্যক্রমে অংশ নেয়ার আহ্বান জানান। আইসিটি সেলের অতিরিক্ত পরিচালক (ভারপ্রাপ্ত) মো. হুমায়ন কবিরের সভাপতিত্বে অনুষ্ঠানে বিশ্ববিদ্যালয়ের ট্রেজারার মোহাম্মদ আবদুল মাননান, রেজিস্ট্রার সৈয়দ ফারুক হোসেন, এপিএ ফোকাল পয়েন্ট মো. আনিসুজ্জামান বিশেষ অতিথি হিসেবে উপস্থিত ছিলেন। 
""",
    imagePath: Images.calendarIc,
    onTap: () {
      Get.to(() => const NoticeDetailsScreen(date: '', title: '', details: '',));
    },
  ),
];
